# Imports

In [1]:
import pandas as pd
from sqlalchemy import create_engine, text

#### connect to SQL

In [2]:
database_name = 'scooters'
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"
engine = create_engine(connection_string)

In [3]:
timeframequery = '''
SELECT MIN(pubdatetime) AS min_date_time,
		MAX(pubdatetime) AS max_date_time
FROM scooters
'''

In [4]:
with engine.connect() as connection:
    timeframe = pd.read_sql(text(timeframequery), con = connection)

timeframe.head()

            min_date_time       max_date_time
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

## 1) During this period, seven companies offered scooters. How many scooters did each company have in this time frame?

In [5]:
scooters_bird = '''
SELECT *
FROM scooters
WHERE companyname iLike 'Bird';
'''

In [6]:
with engine.connect() as connection:
    scooter_by_company = pd.read_sql(text(scooters_by_company_query), con = connection)

scooter_by_company.head()

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1824

### Did the number for each company change over time? Did scooter usage vary by company?

In [7]:
scooters_query = '''
SELECT companyname,
		sumdid,
        pubdatetime
FROM scooters;
'''

In [8]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(scooters_query), con = connection)

scooters.head()

  companyname        sumdid             pubdatetime
0        Bird  PoweredHEFIV 2019-05-15 08:34:56.387
1        Bird  Powered16JFM 2019-05-15 08:34:56.387
2        Bird  PoweredBI8A9 2019-05-15 08:34:56.387
3        Bird  PoweredF65UW 2019-05-15 08:34:56.387
4        Bird  Powered81XNI 2019-05-15 08:34:56.387